In [1]:
# Dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy.stats as st

In [2]:
# Read into crime data file
crime_file = "./Resources/crime_data.csv"
crime_df = pd.read_csv(crime_file)

In [11]:
# Import percent change in LGA's median housing price file
percent_change_file = ("./Resources/percent_change_perLGA.csv")
percent_change_df = pd.read_csv(percent_change_file)
percent_change_df

       LGA_Name  Percent change in house price  Total Sales
0       Banyule                     -11.610266         2285
1       Bayside                      11.899379         2095
2    Boroondara                      -6.213793         2388
3      Brimbank                       1.093687         2251
4      Cardinia                      -1.474852         2173
5         Casey                       3.280064         5044
6       Darebin                      -5.931583         2699
7     Frankston                      -3.332706         2939
8          Glen                     -14.238339         2552
9       Greater                      -2.125233         2507
10      Hobsons                       0.972562         2347
11         Hume                      -3.848849         3986
12     Kingston                     -10.483110         2909
13         Knox                       4.718328         2520
14   Manningham                      -3.998614         1845
15  Maribyrnong                       0.411944         1243
16    Maroondah                       1.221407         1864
17    Melbourne                      -5.434380         3461
18       Melton                       3.140718         1768
19       Monash                       6.188759         2370
20       Moonee                      -6.223026         1894
21     Moreland                      -5.352872         2814
22   Mornington                       3.143202         3464
23    Nillumbik                      -7.102871         1742
24         Port                      -1.073704         3250
25  Stonnington                      18.775694         1746
26   Whitehorse                     -10.878944         3067
27   Whittlesea                      -4.102611         3659
28      Wyndham                      -1.821427         3792
29        Yarra                      -6.507968         4106

In [4]:
crime_df = crime_df.rename(columns={"Suburb": "LGA_Name"})

In [5]:
crime_df.count()

Unnamed: 0                     870
Year                           870
Year ending                    870
Police Region                  870
LGA_Name                       870
Incidents Recorded             870
Rate per 100,000 population    830
dtype: int64

In [6]:
crime_df = crime_df.dropna()
crime_df.count()

Unnamed: 0                     830
Year                           830
Year ending                    830
Police Region                  830
LGA_Name                       830
Incidents Recorded             830
Rate per 100,000 population    830
dtype: int64

In [7]:
# Retrieve just 2019 data
latest_crime_df = crime_df.loc[crime_df["Year"] == 2019]
latest_crime_df.reset_index(inplace=True, drop=True)
latest_crime_df.head()

,Unnamed: 0,Year,Year ending,Police Region,LGA_Name,Incidents Recorded,"Rate per 100,000 population"
0,87,2019,March,1 North West Metro,Banyule,"7,014","5,328.5"
1,88,2019,March,1 North West Metro,Brimbank,"14,673","7,003.0"
2,89,2019,March,1 North West Metro,Darebin,"11,248","6,850.9"
3,90,2019,March,1 North West Metro,Hobsons Bay,"4,849","4,960.6"
4,91,2019,March,1 North West Metro,Hume,"15,596","6,680.1"

In [17]:
# Retrieve just relevant columns
latest_crime_df = latest_crime_df[["LGA_Name", "Rate per 100,000 population"]]

# Split up data into groups based on LGA_Name
grouped_crime_df = latest_crime_df.groupby(["LGA_Name"])


latest_grouped_crime_df = grouped_crime_df["Rate per 100,000 population"].sum()

# Convert numpy object to pandas dataframe
latest_grouped_crime_df = pd.DataFrame(latest_grouped_crime_df)

latest_grouped_crime_df

                    Rate per 100,000 population
LGA_Name
 Alpine                                3,113.8
 Ararat                                7,691.0
 Ballarat                              7,426.1
 Banyule                               5,328.5
 Bass Coast                            4,911.9
...                                         ...
 Wyndham                               4,238.3
 Yarra                                11,018.3
 Yarra Ranges                          3,617.2
 Yarriambiack                          4,820.0
Total          6,602.5 4,854.9 5,563.3 6,159.6

[80 rows x 1 columns]

In [18]:
# Merge both dataframes
merged_crime_lga = pd.merge(latest_grouped_crime_df, percent_change_df, on="LGA_Name", how="inner")
merged_crime_lga

Empty DataFrame
Columns: [LGA_Name, Rate per 100,000 population, Percent change in house price, Total Sales]
Index: []

In [19]:
merged_crime_lga.count()

LGA_Name                         0
Rate per 100,000 population      0
Percent change in house price    0
Total Sales                      0
dtype: int64